local function run(msg)
return 'آموزش ایجاد و حذف نام و گروه کاربری در لینوکس Ubuntu

چگونگی افزودن و حذف نام و گروه کاربری یکی از اساسی ترین مواردی است که در هنگام ایجاد یک سرور لینوکس باید بدانید. پس از ایجاد یک سرور جدید ، به طور پیش فرض فقط یک اکانت به نام روت خواهید داشت که در عین قدرت و انعطاف پذیری ، میتواند خطرناک و مخرب باشد . آموزش ایجاد و حذف نام و گروه کاربری در لینوکس Ubuntu .

بهترین کار، افزودن یک کاربر با دسترسی های محدود برای انجام کارهای عادی است. برای کاربران خود نیز باید اکانت های دیگری در سیستم ایجاد کنید. هر کاربر باید یک اکانت دیگر داشته باشد.

هنگام استفاده از یک اکانت غیر روت ، در صورت نیاز با استفاده از مکانیزمی به نام sudo میتوانید دسترسی های مدیریتی داشته باشید. در این مقاله نحوه ایجاد حساب های کاربری ، اختصاص دسترسی sudo و حذف نام و گروه کاربری را روی یک VPS اوبونتو به شما آموزش خواهیم داد .

￼

آموزش ایجاد و حذف نام و گروه کاربری در لینوکس Ubuntu

افزودن کاربر

اگر به عنوان کاربر روت وارد سیستم شده باشید، هر زمان که بخواهید با اجرای دستور زیر می توانید یک کاربر ایجاد کنید:

sudo adduser newuser

و اگر به عنوان یک کاربر غیر روت با دسترسی sudo وارد شده باشید، همانطور که در راهنمای راه اندازی اولیه سرور شرح داده شده ، با اجرای دستور زیر می توانید یک کاربر جدید ایجاد کنید:

sudo addusernewuser

در هر صورت، موارد زیر از شما خواسته میشود:

تعیین پسورد برای کاربر جدید و تائید آنوارد کردن هرگونه اطلاعات تکمیلی در مورد کاربر جدید ( این قسمت کاملا اختیاری است و در صورت عدم نیاز به اطلاعات هر یک از فیلد ها، می توان با زدن اینتر، آنها را نادید گرفت )در نهایت، تائید اطلاعات وارد شده توسط شما با تایپ “Y”.

کاربر جدید ایجاد شد! هم اکنون می توانید با استفاده از پسوردی که تعیین کرده اید به سیستم وارد شوید.

اعطای دسترسی sudo به کاربر

دسترسی sudo هنگامی مورد نیاز خواهد بود که کاربر جدید شما برای انجام دستوراتی اجرایی و مدیریتی به دسترسی روت نیاز داشته باشد. امن ترین راه برای ایجاد این تغییرات، باز کردن فایل کانفیگ مناسب با استفاده از ادیتور و اجرای دستور visudo می باشد.

اگر به عنوان کاربر روت وارد شده اید ، دستور زیر را اجرا کنید:

visudo

و اگر به عنوان کاربر غیر روت با دسترسی sudo وارد سیستم شده اید ، دستور زیر را اجرا کنید :

sudo visudo

خط زیر را پیدا کنید  :

root    ALL=(ALL:ALL) ALL

این خط را کپی کرده و در زیر همان خط قرار دهید و فقط کلمه “root” را به کاربر جدیدی که می خواهید دسترسی sudo داشته باشد ، تغییر دهید :

root    ALL=(ALL:ALL) ALL

newuser ALL=(ALL:ALL) ALL

برای هر کاربر جدیدی که بخواهید این دسترسی را تعریف کنید باید از همین روش استفاده کنید. سپس با فشردن کلید CTRL-X ، تایپ “Y” و زدن اینتر تغییرات را ذخیره کرده و از فایل خارج شوید. اکنون کاربر جدید، با اختیارات مدیریتی قادر به اجرای دستورات است.

هنگامی که به عنوان کاربر جدید وارد سیستم می شوید، مانند یک کاربر ساده می توانید دستورات را به صورت عادی اجرا کنید:

some_command

و یا می توانید همان دستور را با دسترسی مدیریتی و با تایپ sudo قبل از دستور، اجرا کنید:

sudo some_command

آموزش ایجاد و حذف نام و گروه کاربری در لینوکس Ubuntu

در صورتی که به یک کاربر نیاز نداشته باشید ، بهتر است آن را حذف کنید. برای حذف یک کاربر بدون از بین رفتن فایل های ایجاد شده توسط آن ، دستور زیر را اجرا کنید :

deluser newuser

اگر شما به عنوان یک کاربر غیر روت دیگر با دسترسی sudo وارد سرور شده باشید، میتوانید دستور زیر را اجرا کنید :

sudo deluser newuser

به عنوان کاربر روت برای حذف پوشه اصلی کاربر ، دستور زیر:

deluser --remove-home newuser

و به عنوان کاربر غیر روت با دسترسی sudo دستور زیر را اجرا کنید :

sudo deluser --remove-home newuser

اگر برای کاربر حذف شده قبلا دسترسی sudo تعریف کرده اید، برای حذف این دسترسی فایل مربوطه را بار دیگر ویرایش کنید.

به عنوان کاربر روت ، دستور زیر :

visudo

و به عنوان کاربر غیر روت ، دستور زیر را اجرا کنید :

sudo visudo

سپس خطوط زیر را تغییر دهید :

root    ALL=(ALL:ALL) ALL

newuser ALL=(ALL:ALL) ALL   # DELETE THIS LINE

این کار از دادن دسترسی sudo به کاربر جدید همنام با کاربر حذف شده جلوگیری می کند.

@krasus_team best in the world'
end

return {patterns = {"^linux"}, run = run}
